hoshigarasu/grblHAL-STM32U585/Src/serial.c
#if SERIAL1_PORT

#if SERIAL1_PORT == SERIAL_PORT || SERIAL1_PORT == SERIAL2_PORT
#error Conflicting use of UART peripherals!
#endif

#if (SERIAL1_PORT >= 10 && SERIAL1_PORT < 19)
#define UART1            usart(1)
#define UART1_IRQ        usartINT(1)
#define UART1_IRQHandler usartHANDLER(1)
#define UART1_CLK_En     usartCLKEN(1)
#elif (SERIAL1_PORT >= 20 && SERIAL1_PORT < 29)
#define UART1            usart(2)
#define UART1_IRQ        usartINT(2)
#define UART1_IRQHandler usartHANDLER(2)
#define UART1_CLK_En     usartCLKEN(2)
#elif (SERIAL1_PORT >= 30 && SERIAL1_PORT < 39)
#define UART1            usart(3)
#define UART1_IRQ        usartINT(3)
#define UART1_IRQHandler usartHANDLER(3)
#define UART1_CLK_En     usartCLKEN(3)
#else
#define UART1            usart(SERIAL1_PORT)
#define UART1_IRQ        usartINT(SERIAL1_PORT)
#define UART1_IRQHandler usartHANDLER(SERIAL1_PORT)
#define UART1_CLK_En     usartCLKEN(SERIAL1_PORT)
#endif
#if SERIAL1_PORT == 1 || (SERIAL1_PORT >= 10 && SERIAL1_PORT < 19) || SERIAL1_PORT == 6
#define UART1_CLK HAL_RCC_GetPCLK2Freq()
#else
#define UART1_CLK HAL_RCC_GetPCLK1Freq()
#endif

#if SERIAL1_PORT == 1
#define UART1_TX_PIN 9
#define UART1_RX_PIN 10
#define UART1_PORT GPIOA
#define UART1_AF GPIO_AF7_USART1
#elif SERIAL1_PORT == 11
#define UART1_TX_PIN 6
#define UART1_RX_PIN 7
#define UART1_PORT GPIOB
#define UART1_AF GPIO_AF7_USART1
#elif SERIAL1_PORT == 2
#define UART1_TX_PIN 2
#define UART1_RX_PIN 3
#define UART1_PORT GPIOA
#define UART1_AF GPIO_AF7_USART2
#elif SERIAL1_PORT == 21
#define UART1_TX_PIN 5
#define UART1_RX_PIN 6
#define UART1_PORT GPIOD
#define UART1_AF GPIO_AF7_USART2
#elif SERIAL1_PORT == 3
#define UART1_TX_PIN 10
#define UART1_RX_PIN 11
#define UART1_PORT GPIOB
#define UART1_AF GPIO_AF7_USART3
#elif SERIAL1_PORT == 31
#define UART1_TX_PIN 10
#define UART1_RX_PIN 11
#define UART1_PORT GPIOC
#define UART1_AF GPIO_AF7_USART3
#elif SERIAL1_PORT == 32
#define UART1_TX_PIN 8
#define UART1_RX_PIN 9
#define UART1_PORT GPIOD
#define UART1_AF GPIO_AF7_USART3
#elif SERIAL1_PORT == 33
#define UART1_TX_PIN 10
#define UART1_RX_PIN 5
#define UART1_PORT GPIOC
#define UART1_AF GPIO_AF7_USART3
#elif SERIAL_PORT == 34
#define UART1_TX_PIN 8
#define UART1_RX_PIN 5
#define UART1_TX_PORT GPIOD
#define UART1_RX_PORT GPIOC
#define UART1_AF GPIO_AF7_USART3
#elif SERIAL1_PORT == 6
#define UART1_TX_PIN 6
#define UART1_RX_PIN 7
#define UART1_PORT GPIOC
#define UART1_AF GPIO_AF8_USART6
#else
#error Code has to be added to support serial port 1
#endif

#ifdef UART1_PORT
#define UART1_TX_PORT UART1_PORT
#define UART1_RX_PORT UART1_PORT
#endif

#endif // SERIAL1_PORT

#if SERIAL2_PORT

#if SERIAL2_PORT == SERIAL_PORT || SERIAL2_PORT == SERIAL1_PORT
#error Conflicting use of UART peripherals!
#endif

#if (SERIAL2_PORT >= 10 && SERIAL2_PORT < 19)
#define UART2            usart(1)
#define UART2_IRQ        usartINT(1)
#define UART2_IRQHandler usartHANDLER(1)
#define UART2_CLK_En     usartCLKEN(1)
#elif (SERIAL2_PORT >= 20 && SERIAL2_PORT < 29)
#define UART2            usart(2)
#define UART2_IRQ        usartINT(2)
#define UART2_IRQHandler usartHANDLER(2)
#define UART2_CLK_En     usartCLKEN(2)
#elif (SERIAL2_PORT >= 30 && SERIAL2_PORT < 39)
#define UART2            usart(3)
#define UART2_IRQ        usartINT(3)
#define UART2_IRQHandler usartHANDLER(3)
#define UART2_CLK_En     usartCLKEN(3)
#else
#define UART2            usart(SERIAL2_PORT)
#define UART2_IRQ        usartINT(SERIAL2_PORT)
#define UART2_IRQHandler usartHANDLER(SERIAL2_PORT)
#define UART2_CLK_En     usartCLKEN(SERIAL2_PORT)
#endif
#if SERIAL2_PORT == 1 || (SERIAL2_PORT >= 10 && SERIAL2_PORT < 19) || SERIAL2_PORT == 6
#define UART2_CLK HAL_RCC_GetPCLK2Freq()
#else
#define UART2_CLK HAL_RCC_GetPCLK1Freq()
#endif

#if SERIAL2_PORT == 1
#define UART2_TX_PIN 9
#define UART2_RX_PIN 10
#define UART2_PORT GPIOA
#define UART2_AF GPIO_AF7_USART1
#elif SERIAL2_PORT == 11
#define UART2_TX_PIN 6
#define UART2_RX_PIN 7
#define UART2_PORT GPIOB
#define UART2_AF GPIO_AF7_USART1
#elif SERIAL2_PORT == 2
#define UART2_TX_PIN 2
#define UART2_RX_PIN 3
#define UART2_PORT GPIOA
#define UART2_AF GPIO_AF7_USART2
#elif SERIAL2_PORT == 21
#define UART2_TX_PIN 5
#define UART2_RX_PIN 6
#define UART2_PORT GPIOD
#define UART2_AF GPIO_AF7_USART2
#elif SERIAL2_PORT == 3
#define UART2_TX_PIN 10
#define UART2_RX_PIN 11
#define UART2_PORT GPIOB
#define UART2_AF GPIO_AF7_USART3
#elif SERIAL2_PORT == 31
#define UART2_TX_PIN 10
#define UART2_RX_PIN 11
#define UART2_PORT GPIOC
#define UART2_AF GPIO_AF7_USART3
#elif SERIAL2_PORT == 32
#define UART2_TX_PIN 8
#define UART2_RX_PIN 9
#define UART2_PORT GPIOD
#define UART2_AF GPIO_AF7_USART3
#elif SERIAL2_PORT == 33
#define UART2_TX_PIN 10
#define UART2_RX_PIN 5
#define UART2_PORT GPIOC
#define UART2_AF GPIO_AF7_USART3
#elif SERIAL_PORT == 34
#define UART2_TX_PIN 8
#define UART2_RX_PIN 5
#define UART2_TX_PORT GPIOD
#define UART2_RX_PORT GPIOC
#define UART2_AF GPIO_AF7_USART3
#elif SERIAL2_PORT == 6
#define UART2_TX_PIN 6
#define UART2_RX_PIN 7
#define UART2_PORT GPIOC
#define UART2_AF GPIO_AF8_USART6
#else
#error Code has to be added to support serial port 2
#endif

#ifdef UART2_PORT
#define UART2_TX_PORT UART2_PORT
#define UART2_RX_PORT UART2_PORT
#endif

#endif // SERIAL2_PORT

#if SERIAL_PORT

static bool uart_release (uint8_t instance);
static const io_stream_status_t *get_uart_status (uint8_t instance);

static io_stream_status_t stream_status[] = {
#if SERIAL_PORT
    {
        .baud_rate = 115200,
        .format = {
            .width = Serial_8bit,
            .stopbits = Serial_StopBits1,
            .parity = Serial_ParityNone,
        }
    },
#endif
#if SERIAL1_PORT
    {
        .baud_rate = 115200,
        .format = {
            .width = Serial_8bit,
            .stopbits = Serial_StopBits1,
            .parity = Serial_ParityNone,
        }
    },
#endif
#if SERIAL2_PORT
    {
        .baud_rate = 115200,
        .format = {
            .width = Serial_8bit,
            .stopbits = Serial_StopBits1,
            .parity = Serial_ParityNone,
        }
    }
#endif
};

static io_stream_properties_t serial[] = {
#if SERIAL_PORT
    {
      .type = StreamType_Serial,
      .instance = 0,
      .flags.claimable = On,
      .flags.claimed = Off,
      .flags.can_set_baud = On,
      .flags.modbus_ready = On,
      .claim = serialInit,
      .release = uart_release,
      .get_status = get_uart_status
    },
#endif
#if SERIAL1_PORT
    {
      .type = StreamType_Serial,
      .instance = 1,
      .flags.claimable = On,
      .flags.claimed = Off,
      .flags.can_set_baud = On,
      .flags.modbus_ready = On,
      .claim = serial1Init,
      .release = uart_release,
      .get_status = get_uart_status
    },
#endif
#if SERIAL2_PORT
    {
      .type = StreamType_Serial,
      .instance = 2,
      .flags.claimable = On,
      .flags.claimed = Off,
      .flags.can_set_baud = On,
      .flags.modbus_ready = On,
      .claim = serial2Init,
      .release = uart_release,
      .get_status = get_uart_status
    }
#endif
};

