hoshigarasu/grblHAL-STM32U585/Src/serial.c
void serialRegisterStreams (void)
{
    static io_stream_details_t streams = {
        .n_streams = sizeof(serial) / sizeof(io_stream_properties_t),
        .streams = serial,
    };

#if SERIAL_PORT

    static const periph_pin_t tx0 = {
        .function = Output_TX,
        .group = PinGroup_UART + 0,
        .port  = UART0_TX_PORT,
        .pin   = UART0_TX_PIN,
        .mode  = { .mask = PINMODE_OUTPUT }
    };

    static const periph_pin_t rx0 = {
        .function = Input_RX,
        .group = PinGroup_UART + 0,
        .port = UART0_RX_PORT,
        .pin = UART0_RX_PIN,
        .mode = { .mask = PINMODE_NONE }
    };

    hal.periph_port.register_pin(&rx0);
    hal.periph_port.register_pin(&tx0);

#endif

#if SERIAL1_PORT

    static const periph_pin_t tx1 = {
        .function = Output_TX,
        .group = PinGroup_UART + 1,
        .port  = UART1_TX_PORT,
        .pin   = UART1_TX_PIN,
        .mode  = { .mask = PINMODE_OUTPUT }
    };

    static const periph_pin_t rx1 = {
        .function = Input_RX,
        .group = PinGroup_UART + 1,
        .port = UART1_RX_PORT,
        .pin = UART1_RX_PIN,
        .mode = { .mask = PINMODE_NONE }
    };

    hal.periph_port.register_pin(&rx1);
    hal.periph_port.register_pin(&tx1);

#endif

#if SERIAL2_PORT

    static const periph_pin_t tx2 = {
        .function = Output_TX,
        .group = PinGroup_UART + 2,
        .port  = UART2_TX_PORT,
        .pin   = UART2_TX_PIN,
        .mode  = { .mask = PINMODE_OUTPUT }
    };

    static const periph_pin_t rx2 = {
        .function = Input_RX,
        .group = PinGroup_UART + 2,
        .port = UART2_RX_PORT,
        .pin = UART2_RX_PIN,
        .mode = { .mask = PINMODE_NONE }
    };

    hal.periph_port.register_pin(&rx2);
    hal.periph_port.register_pin(&tx2);

#endif

    stream_register_streams(&streams);
}

static const io_stream_status_t *get_uart_status (uint8_t instance)
{
    stream_status[instance].flags = serial[instance].flags;

    return &stream_status[instance];
}

static bool uart_release (uint8_t instance)
{
    bool ok;

    if((ok = serial[instance].flags.claimed))
        serial[instance].flags.claimed = Off;

    return ok;
}

#ifdef RS485_DIR_PORT

static void rs485SetDirection (bool tx)
{
    DIGITAL_OUT(RS485_DIR_PORT, RS485_DIR_PIN, tx);
}

#endif // RS485_DIR_PORT

#else

void serialRegisterStreams (void) {}; // No serial ports!

#endif

#if SERIAL_PORT

//
// Returns number of free characters in serial input buffer
//
static uint16_t serialRxFree (void)
{
    uint16_t tail = rxbuf.tail, head = rxbuf.head;

    return (RX_BUFFER_SIZE - 1) - BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

//
// Returns number of characters in serial input buffer
//
static uint16_t serialRxCount (void)
{
    uint32_t tail = rxbuf.tail, head = rxbuf.head;

    return BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

//
// Flushes the serial input buffer
//
static void serialRxFlush (void)
{
    rxbuf.tail = rxbuf.head;
}

//
// Flushes and adds a CAN character to the serial input buffer
//
static void serialRxCancel (void)
{
    rxbuf.data[rxbuf.head] = ASCII_CAN;
    rxbuf.tail = rxbuf.head;
    rxbuf.head = BUFNEXT(rxbuf.head, rxbuf);
}

//
// Writes a character to the serial output stream
//
static bool serialPutC (const uint8_t c)
{
    uint16_t next_head = BUFNEXT(txbuf.head, txbuf);    // Get pointer to next free slot in buffer

    while(txbuf.tail == next_head) {                    // While TX buffer full
        if(!hal.stream_blocking_callback())             // check if blocking for space,
            return false;                               // exit if not (leaves TX buffer in an inconsistent state)
    }
    txbuf.data[txbuf.head] = c;                         // Add data to buffer,
    txbuf.head = next_head;                             // update head pointer and
    UART0->CR1 |= USART_CR1_TXEIE;                      // enable TX interrupts

    return true;
}

//
// Writes a null terminated string to the serial output stream, blocks if buffer full
//
static void serialWriteS (const char *s)
{
    uint8_t c, *ptr = (uint8_t *)s;

    while((c = *ptr++) != '\0')
        serialPutC(c);
}

//
// Writes a number of characters from string to the serial output stream followed by EOL, blocks if buffer full
//
static void serialWrite (const uint8_t *s, uint16_t length)
{
    uint8_t *ptr = (uint8_t *)s;

    while(length--)
        serialPutC(*ptr++);
}

//
// Flushes the serial output buffer
//
static void serialTxFlush (void)
{
    UART0->CR1 &= ~USART_CR1_TXEIE;     // Disable TX interrupts
    txbuf.tail = txbuf.head;
}

//
// Returns number of characters pending transmission
//
static uint16_t serialTxCount (void)
{
    uint32_t tail = txbuf.tail, head = txbuf.head;

    return BUFCOUNT(head, tail, TX_BUFFER_SIZE) + (_U_SR(UART0) & USART_SR_TC ? 0 : 1);
}

//
// serialGetC - returns -1 if no data available
//
static int32_t serialGetC (void)
{
    uint_fast16_t tail = rxbuf.tail;            // Get buffer pointer

    if(tail == rxbuf.head)
        return -1; // no data available

    int32_t data = (int32_t)rxbuf.data[tail];   // Get next character
    rxbuf.tail = BUFNEXT(tail, rxbuf);          // and update pointer

    return data;
}

static bool serialSuspendInput (bool suspend)
{
    return stream_rx_suspend(&rxbuf, suspend);
}

static bool serialSetBaudRate (uint32_t baud_rate)
{
    stream_status[0].baud_rate = baud_rate;

    UART0->CR1 &= ~(USART_CR1_UE|USART_CR1_RXNEIE|USART_CR1_RE|USART_CR1_TE);
#if (SERIAL_PORT >= 90 && SERIAL_PORT < 99)
    /* LPUART BRR = 256 * CLK / baud  (different formula from standard USART) */
    UART0->BRR = (uint32_t)(256ULL * UART0_CLK / baud_rate);
#else
    UART0->BRR = UART_BRR_SAMPLING16(UART0_CLK, baud_rate);
#endif
    UART0->CR1 |= (USART_CR1_RE|USART_CR1_TE|USART_CR1_UE|USART_CR1_RXNEIE);

    return true;
}

static bool serialSetFormat (serial_format_t format)
{
    stream_status[0].format = format;

    UART0->CR1 &= ~(USART_CR1_M|USART_CR1_PCE|USART_CR1_PS);

